app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2009-08-23 10:13:59.321669', 5, 1, 1, 1.0, '2009-08-23 10:13:59.321669') RETURNING "id"
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES(E'Nobuaki Ito', E'Tokyo', '2009-08-23 10:13:59.306923', '2009-08-23 10:13:59.306923', E'check', E'nito@gilt.jp') RETURNING "id"
---
  def save_order
    @count = session[:counter] = 0
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save